The analytical opening type.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public EnergyAnalysisOpeningType OpeningType { get; }
  Visual Basic
Public ReadOnly Property OpeningType As EnergyAnalysisOpeningType
	Get
  Visual C++
public:
property EnergyAnalysisOpeningType OpeningType {
	EnergyAnalysisOpeningType get ();
}
 See Also
  EnergyAnalysisOpening Class
  Autodesk.Revit.DB.Analysis Namespace